In [1]:
# Accessing and Modifying the Index
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)
print(df.index)

RangeIndex(start=0, stop=5, step=1)

In [2]:
df

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [6]:
# set indx
df.set_index("Age")

        Name  Gender  Salary
Age
25      John    Male   50000
30     Alice  Female   55000
22       Bob    Male   40000
35       Eve  Female   70000
28   Charlie    Male   48000

In [7]:
df.reset_index()

   index     Name  Age  Gender  Salary
0      0     John   25    Male   50000
1      1    Alice   30  Female   55000
2      2      Bob   22    Male   40000
3      3      Eve   35  Female   70000
4      4  Charlie   28    Male   48000

In [14]:
 # Indexing with loc
df.loc[1]

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [17]:
# Selecting multiple rows by labels.
df.loc[[1, 2]]

    Name  Age  Gender  Salary
1  Alice   30  Female   55000
2    Bob   22    Male   40000

In [19]:
# Selecting specific rows and columns.
df.loc[[1, 3], ['Name']]

    Name
1  Alice
3    Eve

In [20]:
# Slicing rows and columns by labels
df.loc[1:3, 'Name':'Salary']

    Name  Age  Gender  Salary
1  Alice   30  Female   55000
2    Bob   22    Male   40000
3    Eve   35  Female   70000